package order

// Структура, яка представляє користувача
type User struct {
	Name     string
	Email    string
	Password string
}

// Структура, яка представляє замовлення
type Order struct {
	User       User
	Product    string
	TotalPrice float64
}

// Функція, яка обробляє замовлення та відправляє повідомлення користувачу
func ProcessOrder(order Order) {
	// Реалізація обробки замовлення та відправлення повідомлення користувачу
}

//У цьому коді ми бачимо, що структура Order містить поле user, яке є об'єктом типу User.
//Це призводить до тісного зв'язку між цими структурами, оскільки замовлення не може існувати без користувача,
//і замовлення використовує весь об'єкт User. Це може стати проблемою, коли ми хочемо внести зміни в структуру User,
//оскільки це може вплинути на всі замовлення, які використовують цей об'єкт.

//Це приклад high coupling, оскільки структури Order і User пов'язані між собою дуже тісно,
//і будь-які зміни в одній структурі можуть вплинути на іншу структуру.
